import os
import asyncio
import aiogram.utils
from aiogram import Bot, Dispatcher, F, types
from aiogram.filters import CommandStart, Command
from aiogram.filters.command import Command 
from aiogram.types import Message, CallbackQuery, InlineKeyboardMarkup, InlineKeyboardButton
from aiogram.client.session.aiohttp import AiohttpSession
from dotenv import load_dotenv
from random import choice

load_dotenv()

session = os.getenv('session = session')
session = AiohttpSession(proxy='http://proxy.server:3128')
bot = Bot(token='TOKEN', session = session, proxy="http://proxy.server:3128" )
TOKEN = os.getenv('TOKEN')
dp = Dispatcher()

# Список улиц для выбора
STREET_LIST = [
   "1 Мая  ",
    "1342 км разъезд",
    "1352 км разъезд",
    "2-й микрорайон",
    "60 лет ДОСААФ  ",
    "8 Марта  ",
    "Автомобилистов  ",
    "Акимова  ",
    "Аксакова  ",
    "Алтайская  ",
    "Безымянная  ",
    "Березовая  ",
    "Больничная  ",
    "Бронная  ",
    "Бугульминская  ",
    "Бугурусланская  ",
    "Бузулукская  ",
    "Вернадского  ",
    "Водокачечная  ",
    "Вознесенского  ",
    "Войкова  ",
    "Волгоградская  ",
    "Володарского  ",
    "Ворошилова  ",
    "Восточный переулок",
    "Высотная  ",
    "Гагарина  ",
    "Гая  ",
    "Геологов  ",
    "Герцена  ",
    "Глинки  ",
    "Гоголя  ",
    "Гречушкина  ",
    "Дачная  ",
    "Дзержинского  ",
    "Днепровской Дивизии  ",
    "Достоевского  ",
    "Есенина  ",
    "Железнодорожная  ",
    "Жемчужная  ",
    "Жукова  ",
    "Заводская  ",
    "Заозерная  ",
    "Звездная  ",
    "Зеленая  ",
    "Зуйкова  ",
    "Изумрудная  ",
    "Илекская  ",
    "Илецкая  ",
    "Интернациональная  ",
    "Иркутская  ",
    "Казакова  ",
    "Калинина  ",
    "Карла Маркса  ",
    "Киевская  ",
    "Кленовая  ",
    "Колхозная  ",
    "Комарова  ",
    "Комсомольская  ",
    "Коновалова  ",
    "Кооперативная  ",
    "Космическая  ",
    "Котовского  ",
    "Красноармейская  ",
    "Красногвардейская  ",
    "Крестьянская  ",
    "Крупская  ",
    "Крылова  ",
    "Куйбышева  ",
    "Курская  ",
    "Кутузова  ",
    "Лавкова  ",
    "Ленина  ",
    "Лермонтова  ",
    "Лескова  ",
    "Ломоносова  ",
    "Лошкова  ",
    "Луговая  ",
    "Луначарского  ",
    "Льва Толстого  ",
    "Магистральная  ",
    "Максима Горького  ",
    "Маньяшенская  ",
    "Матросова  ",
    "Махмудова  ",
    "Маяковского  ",
    "Мельзавод -10  ",
    "Мелькомбинат  ",
    "Мельничная  ",
    "Менделеева  ",
    "Минская  ",
    "Мира  ",
    "Мирный переулок",
    "Мичурина  ",
    "Молодежная  ",
    "Морозова  ",
    "Московская  ",
    "Мусы Джалиля  ",
    "Набережная  ",
    "Набокова  ",
    "Нагорная  ",
    "Невская  ",
    "Неглинная  ",
    "Некрасова  ",
    "Нефтяников  ",
    "Нефтяников бульвар",
    "Новая  ",
    "Новый переулок",
    "Октябрьская  ",
    "Омская  ",
    "Орджоникидзе  ",
    "Оренбургская  ",
    "Орловская  ",
    "Орская  ",
    "Островского  ",
    "Пановская  ",
    "Парковый проспект",
    "Партизанская  ",
    "Пионерская  ",
    "Плеханова  ",
    "Плешановская  ",
    "Победы  ",
    "Полевая  ",
    "Почтовая  ",
    "Привокзальная  ",
    "Пролетарская  ",
    "Промышленная  ",
    "Пугачева  ",
    "Пушкина  ",
    "Пятигорская  ",
    "Речная  ",
    "Рокоссовского  ",
    "Рябиновая  ",
    "Садовая  ",
    "Самарская  ",
    "Санитарная  ",
    "Саратовская  ",
    "Северная  ",
    "Сидоровнина  ",
    "Сиреневая  ",
    "Советская  ",
    "Соколиная  ",
    "Солнечная  ",
    "Староэлеваторская  ",
    "Строительная  ",
    "Суворова  ",
    "Ташкентская  ",
    "Ташлинская  ",
    "Тверская  ",
    "Тимирязева  ",
    "Томская  ",
    "Транспортная  ",
    "Тургенева  ",
    "Уральская  ",
    "Урановая  ",
    "Устинова  ",
    "Ушакова  ",
    "Фадеева  ",
    "Фридриха Энгельса  ",
    "Фрунзе  ",
    "Фурманова  ",
    "Хабаровская  ",
    "Хлебная  ",
    "Цветочная  ",
    "Циолковского  ",
    "Чайковского  ",
    "Чапаева  ",
    "Чернышевского  ",
    "Чехова  ",
    "Чкалова  ",
    "Шаталова  ",
    "Школьный  ",
    "Шолохова  ",
    "Шоссейная  ",
    "Элеваторская  ",
    "Энергетиков  ",
    "Энтузиастов  ",
    "Юбилейная  ",
    "Южная  ",
    "Ягодная  ",
    "Ялтинская  ",
    "Яновского  ",
    "Янтарная   "
]

# Объект диспетчера
dp = Dispatcher()

# Объект бота
bot = Bot(token=TOKEN)

# Функция обработки команды /start
@dp.message(CommandStart())
async def start_command(message: types.Message):
    keyboard = types.InlineKeyboardMarkup(inline_keyboard=[
        [types.InlineKeyboardButton(text="Поиск адреса...", callback_data="start")]
    ])
    await message.answer("Начать.🔎", reply_markup=keyboard)

# Обработка нажатия кнопки "Поиск адреса..."
@dp.callback_query(F.data == "start")
async def process_start_button(callback: types.CallbackQuery):
    keyboard = types.InlineKeyboardMarkup(inline_keyboard=[
        [types.InlineKeyboardButton(text="Поехали ➡️", callback_data="roll")]
    ])
    await callback.message.edit_text("Запуск ", reply_markup=keyboard)

# Эффект плавной остановки (прокрутки улицы)
async def simulate_roll(callback: types.CallbackQuery):
    for _ in range(10):  # Количество итераций прокрутки
        current_street = choice(STREET_LIST)
        await callback.message.edit_text(f"🔄 Прокручиваем... \n{b(current_street)}", parse_mode='HTML')
        await asyncio.sleep(0.5)  # Задержка перед сменой текста
    
    final_result = choice(STREET_LIST)
    return final_result

def b(text):
    return f'<b>{text}</b>'

# Обработка нажатия кнопки "Поехали"
@dp.callback_query(F.data == "roll")
async def roll_button_pressed(callback: types.CallbackQuery):
    final_address = await simulate_roll(callback)
    result_message = f"⬇️ Бонусная Улица ⬇️\n\n<b>📍 Улица:</b> {final_address}\n\n  "

    # Кнопка для нового заказа
    result_keyboard = types.InlineKeyboardMarkup(inline_keyboard=[
        [types.InlineKeyboardButton(text="Попробуй ещё раз 🎲 ", callback_data="repeat")]
    ])
    await callback.message.edit_text(result_message, reply_markup=result_keyboard, parse_mode='HTML')

# Повтор игры
@dp.callback_query(F.data == "repeat")
async def repeat_game(callback: types.CallbackQuery):
    await start_command(callback.message)  # Перезапуск сценария с начала

# Главная функция
async def main():
    await dp.start_polling(bot)

if __name__ == "__main__":
    asyncio.run(main())